modules/testsuite/native-tests/src/test/resources/benchmark/jmeter/JBossWS_ESB_Benchmark.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="1.8">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JBossWS_ESB_Benchmark" enabled="true">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.name">host</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.value">9090</stringProp>
            <stringProp name="Argument.name">port</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Model1_JAXWS" enabled="true">
        <longProp name="ThreadGroup.start_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <longProp name="ThreadGroup.end_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="false">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="variableNames">NumItems,OrderId</stringProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="filename">csvdata.txt</stringProp>
          <boolProp name="stopThread">false</boolProp>
        </CSVDataSet>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="Model1_JAXWS" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:getOrder xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;int_1&gt;1&lt;/int_1&gt;
            &lt;int_2&gt;1&lt;/int_2&gt;
        &lt;/ns1:getOrder&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://${host}:${port}</stringProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="DOC1.2" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:getOrder xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;int_1&gt;1&lt;/int_1&gt;
            &lt;int_2&gt;1&lt;/int_2&gt;
        &lt;/ns1:getOrder&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://localhost:8080/benchmark-doc-ejb</stringProp>
        </SoapSampler>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Envelope Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="-1984138256">Envelope</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>true</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
            </value>
            <name>saveConfig</name>
          </objProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Model2_JAXWS" enabled="false">
        <longProp name="ThreadGroup.start_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <longProp name="ThreadGroup.end_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="false">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="variableNames">NumItems,OrderId</stringProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="filename">csvdata.txt</stringProp>
          <boolProp name="stopThread">false</boolProp>
        </CSVDataSet>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="Model2_JAXWS" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:getOrder xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;int_1&gt;25&lt;/int_1&gt;
            &lt;int_2&gt;1&lt;/int_2&gt;
        &lt;/ns1:getOrder&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://${host}:${port}/jaxws-benchmark-doclit/jse</stringProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="DOC1.2" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:getOrder xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;int_1&gt;1&lt;/int_1&gt;
            &lt;int_2&gt;1&lt;/int_2&gt;
        &lt;/ns1:getOrder&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://localhost:8080/benchmark-doc-ejb</stringProp>
        </SoapSampler>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Envelope Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="-1984138256">Envelope</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>true</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
            </value>
            <name>saveConfig</name>
          </objProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Model3-JAXWS" enabled="false">
        <longProp name="ThreadGroup.start_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <longProp name="ThreadGroup.end_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="Model3-JAXWS" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:echoSimpleType xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;SimpleUserType_1&gt;
                &lt;f&gt;1.0&lt;/f&gt;
                &lt;i&gt;1&lt;/i&gt;
                &lt;s&gt;test&lt;/s&gt;
            &lt;/SimpleUserType_1&gt;
        &lt;/ns1:echoSimpleType&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://${host}:${port}/jaxws-benchmark-doclit/jse</stringProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="DOC3.2" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:echoSimpleType xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;SimpleUserType_1&gt;
                &lt;f&gt;1.0&lt;/f&gt;
                &lt;i&gt;1&lt;/i&gt;
                &lt;s&gt;test&lt;/s&gt;
            &lt;/SimpleUserType_1&gt;
        &lt;/ns1:echoSimpleType&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://localhost:8080/benchmark-doc-ejb</stringProp>
        </SoapSampler>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Envelope Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="-1984138256">Envelope</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>true</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
            </value>
            <name>saveConfig</name>
          </objProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Model4-JAXWS" enabled="false">
        <longProp name="ThreadGroup.start_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <longProp name="ThreadGroup.end_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="Model4-JAXWS" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:echoSimpleType xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;SimpleUserType_1&gt;
                &lt;f&gt;1.0&lt;/f&gt;
                &lt;i&gt;1&lt;/i&gt;
                &lt;s&gt;test&lt;/s&gt;
            &lt;/SimpleUserType_1&gt;
        &lt;/ns1:echoSimpleType&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://${host}:${port}/jaxws-benchmark-doclit/jseHandler</stringProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="DOC3.2" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:echoSimpleType xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;SimpleUserType_1&gt;
                &lt;f&gt;1.0&lt;/f&gt;
                &lt;i&gt;1&lt;/i&gt;
                &lt;s&gt;test&lt;/s&gt;
            &lt;/SimpleUserType_1&gt;
        &lt;/ns1:echoSimpleType&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://localhost:8080/benchmark-doc-ejb</stringProp>
        </SoapSampler>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Envelope Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="-1984138256">Envelope</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>true</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
            </value>
            <name>saveConfig</name>
          </objProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Model5-JAXWS" enabled="false">
        <longProp name="ThreadGroup.start_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <longProp name="ThreadGroup.end_time">1144146988000</longProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="Model5-JAXWS" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:echoArrayOfSimpleUserType xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;arrayOfSimpleUserType_1&gt;
                &lt;f&gt;1.0&lt;/f&gt;
                &lt;i&gt;1&lt;/i&gt;
                &lt;s&gt;test&lt;/s&gt;
            &lt;/arrayOfSimpleUserType_1&gt;
        &lt;/ns1:echoArrayOfSimpleUserType&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://localhost:8080/jaxws-benchmark-doclit/jse</stringProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="DOC2.2" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;env:Envelope xmlns:env=&apos;http://schemas.xmlsoap.org/soap/envelope/&apos;&gt;
    &lt;env:Header/&gt;
    &lt;env:Body&gt;
        &lt;ns1:echoArrayOfSimpleUserType xmlns:ns1=&apos;http://org.jboss.ws/benchmark/types&apos; xmlns:xsi=&apos;http://www.w3.org/2001/XMLSchema-instance&apos;&gt;
            &lt;arrayOfSimpleUserType_1&gt;
                &lt;f&gt;1.0&lt;/f&gt;
                &lt;i&gt;1&lt;/i&gt;
                &lt;s&gt;test&lt;/s&gt;
            &lt;/arrayOfSimpleUserType_1&gt;
        &lt;/ns1:echoArrayOfSimpleUserType&gt;
    &lt;/env:Body&gt;
&lt;/env:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.URL_DATA">http://localhost:8080/benchmark-doc-ejb</stringProp>
        </SoapSampler>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Envelope Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="-1984138256">Envelope</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <stringProp name="Assertion.assume_success">false</stringProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>true</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
            </value>
            <name>saveConfig</name>
          </objProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <objProp>
          <value class="SampleSaveConfiguration">
            <time>true</time>
            <latency>true</latency>
            <timestamp>true</timestamp>
            <success>false</success>
            <label>true</label>
            <code>false</code>
            <message>true</message>
            <threadName>false</threadName>
            <dataType>true</dataType>
            <encoding>false</encoding>
            <assertions>true</assertions>
            <subresults>true</subresults>
            <responseData>false</responseData>
            <samplerData>true</samplerData>
            <xml>false</xml>
            <fieldNames>true</fieldNames>
            <responseHeaders>false</responseHeaders>
            <requestHeaders>false</requestHeaders>
            <responseDataOnError>false</responseDataOnError>
            <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
            <assertionsResultsToSave>0</assertionsResultsToSave>
            <threadCounts>true</threadCounts>
          </value>
          <name>saveConfig</name>
        </objProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>